#+TITLE:     Sample Beamer presentation
#+AUTHOR:    John Wiegley
#+EMAIL:     johnw@newartisans.com
#+DATE:      2018-01-27

#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  en

\setbeamertemplate{footline}{}
\setbeamerfont{block body}{size=\small}
\definecolor{orchid}{RGB}{134, 134, 220}
\definecolor{lightorchid}{RGB}{243, 243, 251}
\setbeamercolor{block title}{fg=white,bg=orchid}
\setbeamercolor{bgcolor}{fg=white,bg=blue}

*** Haskell code
#+name: haskellexample
#+begin_src haskell :exports results
main :: IO ()
main = putStrLn "Hello!"
#+end_src

#+results: haskellexample
: Hello!

